from threading import Event

# Event(): 스레드 간 신호를 주고받기 위한 동기화 객체
new_log_event = Event()

# ===========================================================
# 새로운 이벤트 로그가 생성되었음을 알림을 전달
# ===========================================================
def notify_new_log():

    new_log_event.set()


# ===========================================================
# 새로운 로그가 생성될 때까지 대기
# ===========================================================
def wait_new_log():

    new_log_event.wait()

    new_log_event.clear()