# ===========================================================================
# ===========================================================================
# 저장소 모듈(repository)
# ===========================================================================
# ===========================================================================


from app.utils import json_manager
from app import configs

# ==========================================================
# 계정(JSON) 파일 불러오기
# ==========================================================
def load_accounts():
    return json_manager.load_json(json_manager.ACCOUNT_FILE)


# ==========================================================
# 계정(JSON) 파일 저장하기
# ==========================================================
def save_accounts(accounts):
    return json_manager.save_json(json_manager.ACCOUNT_FILE, accounts)


# ==========================================================
# 삭제된 아이디 목록 불러오기
# ==========================================================
def load_deleted_ids():
    return json_manager.load_json(configs.DELETED_ID_FILE)


# ==========================================================
# 삭제된 아이디 목록 저장하기
# ==========================================================
def save_deleted_ids(deleted_ids):
    json_manager.save_json(
        configs.DELETED_ID_FILE,
        deleted_ids
    )